Revit 2026 API

# ControlledApplicationRecordingJournalFilename Property

---

Retrieve the name of the journal file that Revit is currently recording to.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string RecordingJournalFilename { get; }
```
```vb
Public ReadOnly Property RecordingJournalFilename As String
	Get
```
```cpp
public:
property String^ RecordingJournalFilename {
	String^ get ();
}
```
```fsharp
member RecordingJournalFilename : string with get
```

#### Property Value

String

As Revit operates it keeps a log of operations that the user performs within a file, known as a journal file. These files are useful for providing information about the actions performed in a session and the state of Revit when a problem occurs. These files are included during error reporting to Autodesk.

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace